src/toir_cf/src/Documents/проф_СводныйПланГрафикППР/проф_СводныйПланГрафикППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>проф_СводныйПланГрафикППР</name>
  <attributes>
    <name>НачалоПериодаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПересчетаПланГрафикаППР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНольДляРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокППР</name>
    <attributes>
      <name>ПланГрафикППР</name>
      <type>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПланГрафикРемонта</name>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <registerRecords>InformationRegister.торо_ВсеДокументыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыРемонтов</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыПланированияППР</registerRecords>
  <registerRecords>InformationRegister.торо_ОтмененныеРемонты</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыводДиаграммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияВладелец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладелец</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитаноНаВерсииППР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.проф_НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ЦепочкиРемонта</types>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЦепочка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланРемонтов</name>
    <attributes>
      <name>ID</name>
      <comment>ID ремонта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_базы_расчета</name>
      <comment>Id базы расчета</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_замещающего</name>
      <comment>Id замещающего</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачСт</name>
      <comment>Дата начала ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонСт</name>
      <comment>Дата окончания ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещенСт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перенесенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоНормативу</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержитВыходные</name>
      <comment>Добавлено под нужды проектов, потому по умолчанию скрыто</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗакрытия</name>
      <type>
        <types>CatalogRef.торо_ПричиныЗакрытияРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/CommonModules/проф_КорректировкаПланГрафиковППР/Module.bsl
#Область ПрограммныйИнтерфейс

//++ Проф-ИТ, #227, Соловьёв.А.А., 18.08.2023

Процедура проф_КорректировкаПланГрафиковППР() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(проф_СводныйПланГрафикППР.НачалоПериодаПланирования) КАК НачалоПериодаПланирования
	|ПОМЕСТИТЬ втПериодПланированияАктуальногоДокумента
	|ИЗ
	|	Документ.проф_СводныйПланГрафикППР КАК проф_СводныйПланГрафикППР
	|ГДЕ
	|	проф_СводныйПланГрафикППР.НачалоПериодаПланирования <= &ТекущаяДата
	|	И проф_СводныйПланГрафикППР.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	проф_СводныйПланГрафикППРСписокППР.ПланГрафикППР КАК ПланГрафикППР,
	|	проф_СводныйПланГрафикППР.ИнтервалПересчетаПланГрафикаППР КАК ИнтервалПересчета
	|ИЗ
	|	втПериодПланированияАктуальногоДокумента КАК втПериодПланированияАктуальногоДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.проф_СводныйПланГрафикППР КАК проф_СводныйПланГрафикППР
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.проф_СводныйПланГрафикППР.СписокППР КАК проф_СводныйПланГрафикППРСписокППР
	|			ПО проф_СводныйПланГрафикППР.Ссылка = проф_СводныйПланГрафикППРСписокППР.Ссылка
	|		ПО втПериодПланированияАктуальногоДокумента.НачалоПериодаПланирования = проф_СводныйПланГрафикППР.НачалоПериодаПланирования";
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			
			ДокументОснование = ПоследнийПодчиненныйДокумент(Выборка.ПланГрафикППР);
			
			НовыйДокумент = Документы.торо_ПланГрафикРемонта.СоздатьДокумент();
			НовыйДокумент.Заполнить(ДокументОснование);
			НовыйДокумент.Дата = ТекущаяДата;
			НовыйДокумент.ПериодичностьДетализации = Перечисления.Периодичность.День;
			НовыйДокумент.ДатаПланирования = ТекущаяДата;
			НовыйДокумент.КоличествоПериодов = (ДеньГода(КонецГода(ТекущаяДата)) - ДеньГода(ТекущаяДата) + 1);
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
			торо_РасчетППР.РасчетППР(НовыйДокумент.Ссылка, Ложь, Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Корректировка План-графиков ППР'"), 
			УровеньЖурналаРегистрации.Ошибка, ДокументОснование,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

//-- Проф-ИТ, #227, Соловьёв.А.А., 18.08.2023

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #227, Соловьёв.А.А., 18.08.2023

Функция ПоследнийПодчиненныйДокумент(ОсновнойДокумент)
	
	ТаблицаСвязанныхДокументов = Новый ТаблицаЗначений;
	ТаблицаСвязанныхДокументов.Колонки.Добавить("Ссылка");
	НоваяСтрока = ТаблицаСвязанныхДокументов.Добавить();
	НоваяСтрока.Ссылка = ОсновнойДокумент;
	
	Для Каждого СтрокаТаблицы Из ТаблицаСвязанныхДокументов Цикл
		МассивСвязанныхДокументов = КритерииОтбора.СвязанныеДокументы.Найти(СтрокаТаблицы.Ссылка);
		
		Для Каждого ЭлементКоллекции Из МассивСвязанныхДокументов Цикл
			РезультатПоиска = ТаблицаСвязанныхДокументов.Найти(ЭлементКоллекции);
			Если РезультатПоиска = Неопределено И ТипЗнч(ЭлементКоллекции.Ссылка) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
				ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементКоллекции.Ссылка, "Проведен");
				Если ДокументПроведен Тогда 
					НоваяСтрока = ТаблицаСвязанныхДокументов.Добавить();
					НоваяСтрока.Ссылка = ЭлементКоллекции.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаСвязанныхДокументов.Сортировать("Ссылка УБЫВ");
	
	Возврат ТаблицаСвязанныхДокументов[0].Ссылка;
	
КонецФункции

//-- Проф-ИТ, #227, Соловьёв.А.А., 18.08.2023

#КонецОбласти
